a = [4, 8, 6, 1] # №1
b = a[:]
a.sort()
print(a)
print(b) # Дело в том, что на первый список применили функцию сортировки
#-------------------------------------------------------------------------------------
import random # №2
a=[]
for i in range(0,100):
    a.append(random.randrange(1,100))
sum = 0 # 1) - По оформлению- это подпункт задания №2
mult = 1
for i in range(0,100):
    sum += a[i]
    mult *= a[i]
print(sum)
print(mult)
#-------------------------------------------------------------------------------------
print(max(a)) # 2)
#-------------------------------------------------------------------------------------
a.sort() # 3)
count=1
for i in range(0,99):
    if a[i]==a[i+1]:
        count+=1
    else:
        if count>1:
            print(a[i],'в количестве',count)
        count=1
if count>1:
    print(a[i],'в количестве',count)
#-------------------------------------------------------------------------------------
b = a.index(min(a)) # 4)
c = a.index(max(a))
a[b],a[c]=a[c],a[b]
#-------------------------------------------------------------------------------------
y16=[22000 ,190000,245000,151000,98000,354000,126000,124000,121000,148237,252300,324774]# №3
y17=[88000 ,168446 ,137590 ,81000 ,102000 ,321000 ,345120 ,153010 ,320172 ,231423 ,245100,256484]
y18= [465000 ,285333 ,134000 ,353000 ,136000 ,234126 ,345600 ,352023 ,153230, 172000 ,412986 ,354128]
yall= [] # 1)
yall.extend(y16)
yall.extend(y17)
yall.extend(y18)
maxpr = yall.index(max(yall))
minpr = yall.index(min(yall))
dict1 = {0: "2016",
         1: "2017",
         2: "2018"}
dict2 = {0: "Январь",
        1: "Февраль",
        2: "Март",
        3: "Апрель",
        4: "Май",
        5: "Июнь",
        6: "Июль",
        7: "Август",
        8: "Сентябрь",
        9: "Октябрь",
        10: "Ноябрь",
        11: "Декабрь"}
print(dict2[maxpr%12],dict1[maxpr//12],'- Максимальная прибыль')
print(dict2[minpr%12],dict1[minpr//12],'- Минимальная прибыль')
#-------------------------------------------------------------------------------------
yall= [] # 2)
yall.extend(y16)
yall.extend(y17)
yall.extend(y18)
count = 0
dict1 = {0: "2016",
         1: "2017",
         2: "2018"}
dict2 = {0: "Январь",
        1: "Февраль",
        2: "Март",
        3: "Апрель",
        4: "Май",
        5: "Июнь",
        6: "Июль",
        7: "Август",
        8: "Сентябрь",
        9: "Октябрь",
        10: "Ноябрь",
        11: "Декабрь"}
print(len(yall))
for i in range(0,len(yall)-1):
    if yall[i+1]>yall[i]:
        count+=1
    else:
        if count!=0:
            print(dict2[(i-count)%12],dict1[(i-count)//12],' - ',dict2[i%12],dict1[i//12])
        count=0
#-------------------------------------------------------------------------------------
a = [] # №4 - Я скопировал решение задания 2, но сохранил результаты в файле
with open("result2.txt","w") as f:
    for i in range(0, 100):
        a.append(random.randrange(1, 100))
    sum = 0  # 1)
    mult = 1
    for i in range(0, 100):
        sum += a[i]
        mult *= a[i]
    f.write("1)"+ str(sum)+"\n")
    f.write(str(mult)+"\n")
# -------------------------------------------------------------------------------------
    f.write("2)"+ str(max(a))+"\n") # 2)
# -------------------------------------------------------------------------------------
    f.write("3)") # 3)
    a.sort()
    count = 1
    for i in range(0, 99):
        if a[i] == a[i + 1]:
            count += 1
        else:
            if count > 1:
                f.write(str(a[i])+ ' в количестве'+str(count)+"\n")
            count = 1
    if count > 1:
        f.write(str(a[i])+ ' в количестве'+str(count)+"\n")







